###############################################################################
# Created by write_sdc
# Thu Feb 22 22:18:49 2024
###############################################################################
current_design ioenb
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name prog_clk -period 25.0000 
set_clock_uncertainty 0.2500 prog_clk
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[0]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[10]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[11]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[12]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[13]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[14]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[15]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[16]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[17]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[18]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[19]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[1]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[20]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[21]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[22]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[23]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[24]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[25]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[26]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[27]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[28]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[29]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[2]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[30]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[31]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[32]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[33]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[34]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[35]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[36]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[37]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[3]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[4]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[5]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[6]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[7]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[8]}]
set_output_delay 5.0000 -clock [get_clocks {prog_clk}] -add_delay [get_ports {io_oeb[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {io_oeb[37]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[36]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[35]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[34]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[33]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[32]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[31]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[30]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[29]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[28]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[27]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[26]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[25]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[24]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[23]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[22]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[21]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[20]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[19]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[18]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[17]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[16]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[15]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[14]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[13]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[12]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[11]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[10]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[9]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[8]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[7]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[6]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[5]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[4]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[3]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
